Podkova/src/InformationRegisters/СхемыОбеспечения/СхемыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СхемыОбеспечения</name>
  <resources>
    <name>СпособОбеспеченияПотребностей</name>
    <type>
      <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
    </type>
  </resources>
  <dimensions>
    <name>СхемаОбеспечения</name>
    <type>
      <types>CatalogRef.СхемыОбеспечения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/ВариантыОбеспеченияРаботами/ВариантыОбеспеченияРаботами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВариантыОбеспеченияРаботами</name>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособОбеспеченияПотребностей</name>
    <type>
      <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/ВариантыОбеспеченияТоварами/ВариантыОбеспеченияТоварами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВариантыОбеспеченияТоварами</name>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособОбеспеченияПотребностей</name>
    <type>
      <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/ТипыОбеспечения/ТипыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбеспечения</name>
  <enumValues>
    <name>Покупка</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>СборкаРазборка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоНаСтороне</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Catalogs/СпособыОбеспеченияПотребностей/СпособыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОбеспеченияПотребностей</name>
  <comment>содержит параметры источника пополнения запаса и временные параметры обеспечения</comment>
  <attributes>
    <name>ИсточникОбеспеченияПотребностей</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбеспечения</name>
    <type>
      <types>EnumRef.ТипыОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныПоставщика</name>
    <type>
      <types>CatalogRef.ВидыЦенПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьВДнях</name>
    <comment>Срок исполнения заказа источником обеспечения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечиваемыйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПлановыеЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГарантированныйСрокОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Podkova/src/InformationRegisters/СхемыОбеспечения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Предназначена для получения текста запроса временной таблицы "ВтСпособыОбеспечения",
// содержащей основной способ обеспечения для списка товаров и складов.
//
// Параметры:
//  ФорматыСкладов - Строка - если значение параметра "ВЫЧИСЛЯТЬ", то будет создана временная таблица "ВтФорматыСкладов",
//                            иначе считается что на момент исполнения запроса эта таблица уже существует.
//
// Возвращаемое значение:
//  Строка - текст запроса запроса временной таблицы ВтСпособыОбеспечения".
//
Функция ВременнаяТаблицаСпособыОбеспечения(ФорматыСкладов) Экспорт
	
	ТекстЗапроса = "";
	Если ФорматыСкладов = "ВЫЧИСЛЯТЬ" Тогда
		
		ТекстЗапроса = Справочники.ФорматыМагазинов.ТекстЗапросаВтФорматыСкладов();
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТоварнаяМатрица.Номенклатура   КАК Номенклатура,
	|	ТоварнаяМатрица.Характеристика КАК Характеристика,
	|	ТоварнаяМатрица.Склад          КАК Склад,
	|	
	|	ЕСТЬNULL(СпрСпособ.Ссылка, ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)) КАК СпособОбеспеченияПотребностей,
	|	ВЫБОР ЕСТЬNULL(СпрСпособ.ТипОбеспечения, ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.ПустаяСсылка))
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство)
	|			ТОГДА 1
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.СборкаРазборка)
	|			ТОГДА 2
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.ПроизводствоНаСтороне)
	|			ТОГДА 3
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Покупка)
	|			ТОГДА 4
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
	|			ТОГДА 5
	|		ИНАЧЕ 9999
	|	КОНЕЦ КАК ПриоритетТипаОбеспечения,
	|	
	|	ВЫБОР КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		
	|			СпрНоменклатура.СпособОбеспеченияПотребностей
	|			
	|		ИНАЧЕ
	|			
	|			ЕСТЬNULL(ТаблицаСхемыОбеспеченияСкладов.СпособОбеспеченияПотребностей,
	|					ЕСТЬNULL(ТаблицаСхемыОбеспеченияФорматов.СпособОбеспеченияПотребностей,
	|						ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)))
	|			
	|		КОНЕЦ                      КАК СпособОбеспеченияПотребностейУнаследованный,
	|		
	|	ВЫБОР КОГДА НЕ ТаблицаВариантыОбеспеченияТоварами.Номенклатура ЕСТЬ NULL ИЛИ НЕ ТаблицаВариантыОбеспеченияРаботами.Номенклатура ЕСТЬ NULL ТОГДА
	|				
	|				""НоменклатураХарактеристикаСклад""
	|				
	|			КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|				
	|				""Номенклатура""
	|				
	|			ИНАЧЕ
	|				
	|				""СхемаОбеспечения""
	|				
	|		КОНЕЦ КАК ИсточникНастройки
	|	
	|ПОМЕСТИТЬ ВтСпособыОбеспечения
	|ИЗ
	|	ВтТовары КАК ТоварнаяМатрица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО СпрНоменклатура.Ссылка = ТоварнаяМатрица.Номенклатура
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыОбеспеченияРаботами КАК ТаблицаВариантыОбеспеченияРаботами
	|		ПО СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		 И ТаблицаВариантыОбеспеченияРаботами.Номенклатура   = ТоварнаяМатрица.Номенклатура
	|		 И ТаблицаВариантыОбеспеченияРаботами.Характеристика = ТоварнаяМатрица.Характеристика
	|		 И ТаблицаВариантыОбеспеченияРаботами.РеквизитДопУпорядочивания = 1
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыОбеспеченияТоварами КАК ТаблицаВариантыОбеспеченияТоварами
	|		ПО СпрНоменклатура.ТипНоменклатуры В(
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор))
	|		 И ТаблицаВариантыОбеспеченияТоварами.Номенклатура   = ТоварнаяМатрица.Номенклатура
	|		 И ТаблицаВариантыОбеспеченияТоварами.Характеристика = ТоварнаяМатрица.Характеристика
	|		 И ТаблицаВариантыОбеспеченияТоварами.Склад          = ТоварнаяМатрица.Склад
	|		 И ТаблицаВариантыОбеспеченияТоварами.РеквизитДопУпорядочивания = 1
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтФорматыСкладов КАК ТаблицаФорматыСкладов
	|		ПО ТаблицаФорматыСкладов.Склад = ТоварнаяМатрица.Склад
	|		 И ТаблицаВариантыОбеспеченияТоварами.Номенклатура ЕСТЬ NULL
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК ТаблицаСхемыОбеспеченияСкладов
	|		ПО ТаблицаСхемыОбеспеченияСкладов.СхемаОбеспечения = СпрНоменклатура.СхемаОбеспечения
	|		 И ТаблицаСхемыОбеспеченияСкладов.Склад = ТоварнаяМатрица.Склад
	|		 И ТаблицаВариантыОбеспеченияТоварами.Номенклатура ЕСТЬ NULL
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК ТаблицаСхемыОбеспеченияФорматов
	|		ПО ТаблицаСхемыОбеспеченияФорматов.СхемаОбеспечения = СпрНоменклатура.СхемаОбеспечения
	|		 И ТаблицаСхемыОбеспеченияФорматов.Склад = ТаблицаФорматыСкладов.ФорматМагазина
	|		 И ТаблицаСхемыОбеспеченияСкладов.СхемаОбеспечения ЕСТЬ NULL
	|		 И ТаблицаВариантыОбеспеченияТоварами.Номенклатура ЕСТЬ NULL
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
	|		ПО ВЫБОР КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|						
	|						ЕСТЬNULL(ТаблицаВариантыОбеспеченияРаботами.СпособОбеспеченияПотребностей,
	|							СпрНоменклатура.СпособОбеспеченияПотребностей)
	|						
	|					ИНАЧЕ
	|						
	|						ЕСТЬNULL(ТаблицаВариантыОбеспеченияТоварами.СпособОбеспеченияПотребностей,
	|							ЕСТЬNULL(ТаблицаСхемыОбеспеченияСкладов.СпособОбеспеченияПотребностей,
	|								ЕСТЬNULL(ТаблицаСхемыОбеспеченияФорматов.СпособОбеспеченияПотребностей,
	|									ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка))))
	|						
	|				КОНЕЦ = СпрСпособ.Ссылка
	|		
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура, Характеристика, Склад
	|;
	|
	|////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Предназначена для получения текста запроса временной таблицы "ВтСпособыОбеспечения",
// содержащей основной способ обеспечения на всех складах для списка товаров.
//
// Параметры:
//  ТипОбеспечения - ПеречислениеСсылка.ТипыОбеспечения - если установлено значение типа обеспечения "Перемещение",
//                                                        то результат будет содержать только товары и склады с основным
//                                                        способом обеспечения путем перемещения.
//
// Возвращаемое значение:
//  Строка - текст запроса запроса временной таблицы ВтСпособыОбеспечения".
//
Функция ВременнаяТаблицаСпособыОбеспеченияВсехСкладов(ТипОбеспечения = Неопределено) Экспорт
	
	ТекстЗапроса = Справочники.ФорматыМагазинов.ТекстЗапросаВтФорматыСкладов(Ложь);
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Набор.Номенклатура   КАК Номенклатура,
		|	Набор.Характеристика КАК Характеристика,
		|	Набор.Склад          КАК Склад,
		|	Набор.СпособОбеспеченияПотребностей КАК СпособОбеспеченияПотребностей
		|ПОМЕСТИТЬ ВтСпособыОбеспечения
		|ИЗ(
		|	ВЫБРАТЬ
		|		ТоварнаяМатрица.Номенклатура   КАК Номенклатура,
		|		ТоварнаяМатрица.Характеристика КАК Характеристика,
		|		
		|		Настройка.Склад                         КАК Склад,
		|		Настройка.СпособОбеспеченияПотребностей КАК СпособОбеспеченияПотребностей
		|	ИЗ
		|		ВтТовары КАК ТоварнаяМатрица
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыОбеспеченияТоварами КАК Настройка
		|			ПО Настройка.Номенклатура   = ТоварнаяМатрица.Номенклатура
		|			 И Настройка.Характеристика = ТоварнаяМатрица.Характеристика
		|			 И Настройка.РеквизитДопУпорядочивания = 1
		|	ГДЕ
		|		НЕ Настройка.Склад ЕСТЬ NULL
		|		И &Отборы
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварнаяМатрица.Номенклатура   КАК Номенклатура,
		|		ТоварнаяМатрица.Характеристика КАК Характеристика,
		|		
		|		Настройка.Склад                         КАК Склад,
		|		Настройка.СпособОбеспеченияПотребностей КАК СпособОбеспеченияПотребностей
		|	ИЗ
		|		ВтТовары КАК ТоварнаяМатрица
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК Настройка
		|			ПО Настройка.СхемаОбеспечения = ТоварнаяМатрица.Номенклатура.СхемаОбеспечения
		|			 И Настройка.Склад ССЫЛКА Справочник.Склады
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыОбеспеченияТоварами КАК ВытесняющаяНастройка
		|			ПО ВытесняющаяНастройка.Номенклатура   = ТоварнаяМатрица.Номенклатура
		|			 И ВытесняющаяНастройка.Характеристика = ТоварнаяМатрица.Характеристика
		|			 И ВытесняющаяНастройка.Склад          = Настройка.Склад
		|			 И ВытесняющаяНастройка.РеквизитДопУпорядочивания = 1
		|	ГДЕ
		|		НЕ Настройка.Склад ЕСТЬ NULL
		|		И ВытесняющаяНастройка.Склад ЕСТЬ NULL
		|		И &Отборы
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварнаяМатрица.Номенклатура   КАК Номенклатура,
		|		ТоварнаяМатрица.Характеристика КАК Характеристика,
		|		
		|		СкладыФормата.Склад                     КАК Склад,
		|		Настройка.СпособОбеспеченияПотребностей КАК СпособОбеспеченияПотребностей
		|	ИЗ
		|		ВтТовары КАК ТоварнаяМатрица
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК Настройка
		|			ПО Настройка.СхемаОбеспечения = ТоварнаяМатрица.Номенклатура.СхемаОбеспечения
		|			 И Настройка.Склад ССЫЛКА Справочник.ФорматыМагазинов
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВтФорматыСкладов КАК СкладыФормата
		|			ПО СкладыФормата.ФорматМагазина = Настройка.Склад
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК ВытесняющаяНастройкаСхемы
		|			ПО ВытесняющаяНастройкаСхемы.СхемаОбеспечения = ТоварнаяМатрица.Номенклатура.СхемаОбеспечения
		|			 И ВытесняющаяНастройкаСхемы.Склад ССЫЛКА Справочник.Склады
		|			 И ВытесняющаяНастройкаСхемы.Склад = СкладыФормата.Склад
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыОбеспеченияТоварами КАК ВытесняющаяНастройка
		|			ПО ВытесняющаяНастройка.Номенклатура   = ТоварнаяМатрица.Номенклатура
		|			 И ВытесняющаяНастройка.Характеристика = ТоварнаяМатрица.Характеристика
		|			 И ВытесняющаяНастройка.Склад          = СкладыФормата.Склад
		|			 И ВытесняющаяНастройка.РеквизитДопУпорядочивания = 1
		|	ГДЕ
		|		НЕ Настройка.Склад ЕСТЬ NULL
		|		И НЕ СкладыФормата.Склад ЕСТЬ NULL
		|		И ВытесняющаяНастройкаСхемы.Склад ЕСТЬ NULL
		|		И ВытесняющаяНастройка.Склад ЕСТЬ NULL
		|		И &Отборы) КАК Набор
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|////////////////////////////////////
		|";
	
	ПодстрокаЗамены = "";
	Если ТипОбеспечения = Перечисления.ТипыОбеспечения.Перемещение Тогда
		
		ПодстрокаЗамены = "Настройка.СпособОбеспеченияПотребностей.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
			|		И Настройка.СпособОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей ССЫЛКА Справочник.Склады
			|		И Настройка.СпособОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
		
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Отборы", ПодстрокаЗамены);
	Возврат ТекстЗапроса;
	
КонецФункции

// Подставляет в текст запроса соединения, необходимые для получения основного способа обеспечения товаром на складе или
// работой.
//
// Параметры:
//  ТекстЗапроса	 - Строка - текст запроса, в который нужно подставить соединение
//  ИмяПараметра	 - Строка - имя параметра на место которого будет подставлено соединение
//  ПоляСоединения	 - Строка - поля соединения в формате [ВедущаяТаблица].Номенклатура,[ВедущаяТаблица].Характеристика,[ВедущаяТаблица].Склад.
//  Постфикс         - Строка - уникальный текст для внутренних синонимов таблиц.
// 
// Возвращаемое значение:
//  Строка - новый тест запроса
//
Функция ПодставитьСоединениеДляПолученияСпособаОбеспечения(ТекстЗапроса, ИмяПараметра, ПоляСоединения = Неопределено, Постфикс = "") Экспорт
	
	РезультатПодстановки = ТекстЗапроса;
	Пока Истина Цикл
		
		НачалоПараметра = СтрНайти(РезультатПодстановки, ИмяПараметра, НаправлениеПоиска.СНачала);
		
		Если НачалоПараметра = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПоследнийСимвол = НачалоПараметра + СтрДлина(ИмяПараметра);
		НачалоСинонима = СтрНайти(РезультатПодстановки, "КАК", НаправлениеПоиска.СКонца, НачалоПараметра) + СтрДлина("КАК");
		Синоним = СокрЛП(СтрЗаменить(Сред(РезультатПодстановки, НачалоСинонима, НачалоПараметра - НачалоСинонима - 1), "ПО", ""));
		ПревыйСимвол = СтрНайти(РезультатПодстановки, "СОЕДИНЕНИЕ", НаправлениеПоиска.СКонца, НачалоСинонима) + СтрДлина("СОЕДИНЕНИЕ");
		
		ПодстрокаПоиска = Сред(РезультатПодстановки, ПревыйСимвол, ПоследнийСимвол - ПревыйСимвол);
		ПодстрокаЗамены =
			"		РегистрСведений.ВариантыОбеспеченияРаботами КАК ТаблицаВариантыОбеспеченияРаботамиПереопределяемый
			|		ПО Т.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
			|		 И ТаблицаВариантыОбеспеченияРаботамиПереопределяемый.Номенклатура   = Т.Номенклатура
			|		 И ТаблицаВариантыОбеспеченияРаботамиПереопределяемый.Характеристика = Т.Характеристика
			|		 И ТаблицаВариантыОбеспеченияРаботамиПереопределяемый.РеквизитДопУпорядочивания = 1
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыОбеспеченияТоварами КАК ТаблицаВариантыОбеспеченияТоварамиПереопределяемый
			|		ПО Т.Номенклатура.ТипНоменклатуры В(
			|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
			|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара),
			|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор))
			|		 И ТаблицаВариантыОбеспеченияТоварамиПереопределяемый.Номенклатура   = Т.Номенклатура
			|		 И ТаблицаВариантыОбеспеченияТоварамиПереопределяемый.Характеристика = Т.Характеристика
			|		 И ТаблицаВариантыОбеспеченияТоварамиПереопределяемый.Склад          = Т.Склад
			|		 И ТаблицаВариантыОбеспеченияТоварамиПереопределяемый.РеквизитДопУпорядочивания = 1
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтФорматыСкладов КАК ТаблицаФорматыСкладовПереопределяемый
			|		ПО ТаблицаФорматыСкладовПереопределяемый.Склад = Т.Склад
			|		 И ТаблицаВариантыОбеспеченияТоварамиПереопределяемый.Номенклатура ЕСТЬ NULL
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК ТаблицаСхемыОбеспеченияСкладовПереопределяемый
			|		ПО ТаблицаСхемыОбеспеченияСкладовПереопределяемый.СхемаОбеспечения = Т.Номенклатура.СхемаОбеспечения
			|		 И ТаблицаСхемыОбеспеченияСкладовПереопределяемый.Склад = Т.Склад
			|		 И ТаблицаВариантыОбеспеченияТоварамиПереопределяемый.Номенклатура ЕСТЬ NULL
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК ТаблицаСхемыОбеспеченияФорматовПереопределяемый
			|		ПО ТаблицаСхемыОбеспеченияФорматовПереопределяемый.СхемаОбеспечения = Т.Номенклатура.СхемаОбеспечения
			|		 И ТаблицаСхемыОбеспеченияФорматовПереопределяемый.Склад = ТаблицаФорматыСкладовПереопределяемый.ФорматМагазина
			|		 И ТаблицаСхемыОбеспеченияСкладовПереопределяемый.СхемаОбеспечения ЕСТЬ NULL
			|		 И ТаблицаВариантыОбеспеченияТоварамиПереопределяемый.Номенклатура ЕСТЬ NULL
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
			|		ПО ВЫБОР КОГДА Т.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
			|						
			|						ЕСТЬNULL(ТаблицаВариантыОбеспеченияРаботамиПереопределяемый.СпособОбеспеченияПотребностей,
			|							Т.Номенклатура.СпособОбеспеченияПотребностей)
			|						
			|					ИНАЧЕ
			|						
			|						ЕСТЬNULL(ТаблицаВариантыОбеспеченияТоварамиПереопределяемый.СпособОбеспеченияПотребностей,
			|							ЕСТЬNULL(ТаблицаСхемыОбеспеченияСкладовПереопределяемый.СпособОбеспеченияПотребностей,
			|								ЕСТЬNULL(ТаблицаСхемыОбеспеченияФорматовПереопределяемый.СпособОбеспеченияПотребностей,
			|									ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка))))
			|						
			|				КОНЕЦ = СпрСпособ.Ссылка";
			
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "СпрСпособ", Синоним);
		Если ПоляСоединения <> Неопределено Тогда
			МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоляСоединения);
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "Т.Номенклатура",   МассивПодстрок[0]);
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "Т.Характеристика", МассивПодстрок[1]);
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "Т.Склад",          МассивПодстрок[2]);
		КонецЕсли;
		
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "ТаблицаВариантыОбеспеченияРаботамиПереопределяемый", "ТаблицаВариантыОбеспеченияРаботами" + Постфикс);
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "ТаблицаВариантыОбеспеченияТоварамиПереопределяемый", "ТаблицаВариантыОбеспеченияТоварами" + Постфикс);
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "ТаблицаФорматыСкладовПереопределяемый", "ТаблицаФорматыСкладов" + Постфикс);
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "ТаблицаСхемыОбеспеченияСкладовПереопределяемый", "ТаблицаСхемыОбеспеченияСкладов" + Постфикс);
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "ТаблицаСхемыОбеспеченияФорматовПереопределяемый", "ТаблицаСхемыОбеспеченияФорматов" + Постфикс);
		
		РезультатПодстановки = СтрЗаменить(РезультатПодстановки, ПодстрокаПоиска, ПодстрокаЗамены);
		
	КонецЦикла;
	
	Возврат РезультатПодстановки;
	
КонецФункции

// Для переданных ключей определяет топологию складов. Перечень центров с которых перемещяют товары на удаленные склады.
//
// Параметры:
//  ИмяТаблицыТовары - Строка - имя временной таблицы содержащей набор уникальных ключей:
//                     * Номенклатура   - номенклатура товара,
//                     * Характеристика - характеристика товара.
//
// Возвращаемое значение:
//  Строка - Текст запроса запроса временной таблицы "ТопологияСкладов" с полями:
//           * Номенклатура   - номенклатура товара,
//           * Характеристика - характеристика товара,
//           * Центр          - склад, с которого товары перемещаются на другие склады,
//           * Склад          - склад на который перемещаются товары из центра, а также сам центр распределительной сети.
//
Функция ВременнаяТаблицаТопологияСкладов(ИмяТаблицыТовары) Экспорт
	
	Текст = ВременнаяТаблицаСпособыОбеспеченияВсехСкладов(Перечисления.ТипыОбеспечения.Перемещение);
	Текст = СтрЗаменить(Текст, "ВтТовары", ИмяТаблицыТовары);
	
	ТекстыЗапроса = Новый Массив();
	ТекстыЗапроса.Добавить(Текст);
	
	Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыИСпособыОбеспечения.Номенклатура                                                  КАК Номенклатура,
		|	ТоварыИСпособыОбеспечения.Характеристика                                                КАК Характеристика,
		|	ТоварыИСпособыОбеспечения.Склад                                                         КАК Склад,
		|	ТоварыИСпособыОбеспечения.СпособОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей КАК Центр
		|ПОМЕСТИТЬ ТопологияСкладов
		|ИЗ
		|	ВтСпособыОбеспечения КАК ТоварыИСпособыОбеспечения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыИСпособыОбеспечения.Номенклатура                                                  КАК Номенклатура,
		|	ТоварыИСпособыОбеспечения.Характеристика                                                КАК Характеристика,
		|	ТоварыИСпособыОбеспечения.СпособОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей КАК Склад,
		|	ТоварыИСпособыОбеспечения.СпособОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей КАК Центр
		|ИЗ
		|	ВтСпособыОбеспечения КАК ТоварыИСпособыОбеспечения";
	ТекстыЗапроса.Добавить(Текст);
	Текст = СтрСоединить(ТекстыЗапроса);
	
	ТекстыЗапроса = Новый Массив();
	ТекстыЗапроса.Добавить(Текст);
	
	ТекстыЗапроса.Добавить("УНИЧТОЖИТЬ ВтФорматыскладов");
	ТекстыЗапроса.Добавить("УНИЧТОЖИТЬ ВтСпособыОбеспечения");
	
	Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	Возврат Текст;
	
КонецФункции

// Дополняет переданную таблицу ключей. Для склада, центра распределительной сети,
// добавляет все склады сети согласно тополонии складов.
//
// Параметры:
//  ИмяТаблицыТовары - Строка - имя временной таблицы содержащей ключи (уникальность не требуется):
//                     * Номенклатура   - номенклатура товара,
//                     * Характеристика - характеристика товара,
//                     * Склад          - склад.
//  ДетализироватьДоНазначений - Булево - признак, что в таблице есть назначение.
//
// Возвращаемое значение:
//  Строка - Текст запроса запроса временной таблицы "РазличныеТоварыИСклады" с уникальными ключами:
//           * Номенклатура   - номенклатура товара,
//           * Характеристика - характеристика товара,
//           * Назначение - назначение товара, либо Неопределено,
//           * Склад          - склад.
//
Функция ВременнаяТаблицаРазличныеТоварыИСклады(ИмяТаблицыТовары, ДетализироватьДоНазначений) Экспорт
	
	Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура    КАК Номенклатура,
		|	Товары.Характеристика  КАК Характеристика,
		|	Товары.Склад           КАК Склад,
		|	&ПодстановкаНазначение КАК Назначение
		|ПОМЕСТИТЬ РазличныеТоварыИСклады
		|ИЗ
		|	ИмяТаблицыПереопределяемый КАК Товары
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура    КАК Номенклатура,
		|	Товары.Характеристика  КАК Характеристика,
		|	Топология.Склад        КАК Склад,
		|	&ПодстановкаНазначение КАК Назначение
		|ИЗ
		|	ИмяТаблицыПереопределяемый КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТопологияСкладов КАК Топология
		|		ПО Топология.Номенклатура   =  Товары.Номенклатура
		|		 И Топология.Характеристика =  Товары.Характеристика
		|		 И Топология.Центр          =  Товары.Склад
		|ГДЕ
		|	НЕ Топология.Номенклатура ЕСТЬ NULL
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад";
		
	Текст = СтрЗаменить(Текст, "ИмяТаблицыПереопределяемый", ИмяТаблицыТовары);
	ПодстановкаИтоговая = ?(ДетализироватьДоНазначений, "Товары.Назначение", "НЕОПРЕДЕЛЕНО");
	Текст = СтрЗаменить(Текст, "&ПодстановкаНазначение", ПодстановкаИтоговая);
	
	Возврат Текст;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Склад)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныйПрограммныйИнтерфейс

Процедура Добавить(Склад, СхемаОбеспечения, СпособОбеспечения) Экспорт
	
	Набор = РегистрыСведений.СхемыОбеспечения.СоздатьНаборЗаписей();
	
	Набор.Отбор.СхемаОбеспечения.Установить(СхемаОбеспечения);
	Набор.Отбор.Склад.Установить(Склад);
	
	Запись = Набор.Добавить();
	Запись.СхемаОбеспечения = СхемаОбеспечения;
	Запись.Склад = Склад;
	
	Запись.СпособОбеспеченияПотребностей = СпособОбеспечения;
	Набор.Записать();
	
КонецПроцедуры

Процедура Удалить(Склад, СхемаОбеспечения) Экспорт
	
	Набор = РегистрыСведений.СхемыОбеспечения.СоздатьНаборЗаписей();
	
	Набор.Отбор.СхемаОбеспечения.Установить(СхемаОбеспечения);
	Набор.Отбор.Склад.Установить(Склад);
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
